[
  {
    "version": "1.0.3-alpha",
    "changes": [
      "Added: Terminal (supports basic commands, with java, gradle and commands provided in Android\u0027s SDK, like sdkmanager)",
      "Added: \u0027Go to Definition\u0027 option to find the definition of a method, constructor, class, field or variable in Java files",
      "Added: \u0027Find all references\u0027 to find all the references/usage of a method, class, constructor, field or variables",
      "Added: Clicking on a Diagnostic in the diagnostics list opens the respective file and selects the diagnostic range",
      "Added: Search in current file",
      "Added: Textual search in project source files",
      "Added: You can now pick any project in your device",
      "Added: IDE will open the last opened project automatically",
      "Added: Project information viewer to show some basic information about currently opened project",
      "Added: Option to choose number of spaces to be inserted in a TAB character",
      "Added: Generate debug resources when an XML file is modified",
      "Added: Show API information of classes and members (since, removed, deprecated, etc.)",
      "Added: JavaDoc syntax highlighting",
      "Added: Ability to allow environment variables specified by users",
      "Added: Append new line in String literal when \u0027ENTER\u0027 key is pressed and cursor is in a string.",
      "Added: Gradlew support",
      "Fixed: Library libz.so.1 not found on some devices",
      "Fixed: Crash when clicking the \u0027View\u0027 FAB",
      "Fixed: Installation issue when installing zip files",
      "Fixed: Crash when opening telegram group and Telegram isn\u0027t installed",
      "Fixed: Contents of file got erased on \u0027Close others\u0027 action",
      "Fixed: Invalid insertion of completion items",
      "Fixed: Unresponsive home button in Preference screen\u0027s toolbar",
      "Fixed: Signature help was being always triggered in a lambda scope",
      "Fixed: Invalid cursor position after inserting new block in Java code",
      "Fixed: Logs not being shown properly",
      "Enhanced: Reduced size of file tabs to provide more space for editor.",
      "Enhanced: Diagnostic window now does not show unnecessary information",
      "Removed: Projects list",
      "Removed: AndroidIDE now doesn\u0027t need it\u0027s Gradle Plugin. You could simply remove it from your project."
    ]
  },
  {
    "version": "1.0.2-alpha",
    "changes": [
      "Added: Realtime error checking for current file",
      "Added: Link to issue tracker on GitHub",
      "Added: Do not insert closing symbols if already present in editor",
      "Added: You can now edit any file whose encoding is UTF-8",
      "Added: You can now edit the global gradle.properties file",
      "Added: You can now delete a project from the project\u0027s list (click and hold to show delete option)",
      "Added: Show signature of methods and constructors when typing their parameters",
      "Added: Editor now pins the line number",
      "Fixed: If an opened file is deleted, it was still open even after deleting",
      "Fixed: Lag with the progress dialog while installing build tools",
      "Fixed: App crash when --debug, --info or --scan was enabled for Gradle builds",
      "Fixed: File tree keeps loading on some devices",
      "Fixed: Different text color for buttons in preferences",
      "Fixed: Color of icons in options menu remained unchanged even if the items were disabled",
      "Enhanced: Syntax highlighting of Java files (works only after services are started)",
      "Enhanced: Java completion is much more advanced than earlier versions",
      "Updated: AndroidIDE now comes with an updated JDK built specifically for AndroidIDE."
    ]
  },
  {
    "version": "1.0.1-alpha",
    "changes": [
      "Added: Option to choose custom build tools",
      "Added: Build output is now shown while starting completion services",
      "Added: A preference screen with some basic preferences",
      "Added: \u0027Stop all Daemons\u0027 option now force stops a build if it already running",
      "Added: Option which shows the status of Gradle Daemons",
      "Added: Syntax highlighting and basic (reserved) completion for Gradle files.",
      "Added: Option to recreate completion services",
      "Added: Basic options while creating a new file",
      "Added: You can now invoke the selection mode without selecting a word",
      "Fixed: Bug which caused files from previously created project to be copied to new project",
      "Fixed: Auto import issue when a completion item is selected",
      "Fixed: Orientation issue in downloads activity",
      "Fixed: Sometimes, auto closing tags won\u0027t work as expected",
      "Enhanced: Speed of Java completion has been improved. But still it needs a lot of work.",
      "Enhanced: Starting of completion services is a bit faster as compared to the previous version. But takes more time on first startup."
    ]
  },
  {
    "version": "1.0.0-alpha",
    "changes": [
      "First alpha release"
    ]
  }
]